Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: Before the first line of the file is read, a single zero is pushed on the stack; this will never be popped off again. The numbers pushed on the stack will always be strictly increasing from bottom to top. At the beginning of each logical line, the line's indentation level is compared to the top of the stack. If it is equal, nothing happens. If it is larger, it is pushed on the stack, and one INDENT token is generated. If it is smaller, it *must* be one of the numbers occurring on the stack; all numbers on the stack that are larger are popped off, and for each number popped off a DEDENT token is generated. At the end of the file, a DEDENT token is generated for each number remaining on the stack that is larger than zero.
ru: Перед чтением первой строки файла в стек записывается значение «0», это значение никогда не будет извлечено. Числа, заносимые в стек, будут строго возрастать. В начале каждой условной строки уровень отступа сравнивается с максимальным значением на верху стека; если они равны, то ничего не происходит. Если уровень отступа больше, то он заносится в стек, и создается одна лексема “INDENT” . Если уровень меньше, то это число уже должно быть в стеке; все числа, которые больше, удаляются, и для каждого удаленного числа создается лексема “DEDENT” . В конце файла лексемы “DEDENT” создаются для всех оставшихся в стеке чисел больше ноля.

source: Whitespace between tokens
ru: Пробелы между лексемами

source: Except at the beginning of a logical line or in string literals, the whitespace characters space, tab and formfeed can be used interchangeably to separate tokens. Whitespace is needed between two tokens only if their concatenation could otherwise be interpreted as a different token (e.g., ab is one token, but a b is two tokens).
ru: Кроме начала логической строки или в записи текстовых данных символы пробела, табуляции и перевода страницы могут быть взаимозаменяемы при разделении лексем. Эти символы необходимы между двумя лексемами только, если результат их объединения может быть интерпретирован как другая лексема (например : «``ab``» - это одна лексема, но «``a b``» - две лексемы) .

source: Other tokens
ru: Другие лексемы

source: Besides NEWLINE, INDENT and DEDENT, the following categories of tokens exist: *identifiers*, *keywords*, *literals*, *operators*, and *delimiters*. Whitespace characters (other than line terminators, discussed earlier) are not tokens, but serve to delimit tokens. Where ambiguity exists, a token comprises the longest possible string that forms a legal token, when read from left to right.
ru: Кроме “NEWLINE” , “INDENT” и “DEDENT” , существуют следующие категории лексем: *идентификаторы*, *ключевые слова*, *литералы* (непосредственная запись данных) , *операторы* и *разделители*. Символы пробелов (кроме знаков конца строки, описанных ранее) не являются лексемами, а служат для их разделения. Если появляется неопределенность, лексема включает самую длинную возможную последовательность, представляющую собой действительную лексему (чтение происходит слева направо) .

source: Identifiers and keywords
ru: Идентификаторы и ключевые слова

source: Identifiers (also referred to as *names*) are described by the following lexical definitions.
ru: Идентификаторы (имена) имеют следующее лексическое определение.

source: The syntax of identifiers in Python is based on the Unicode standard annex UAX-31, with elaboration and changes as defined below; see also :pep:`3131` for further details.
ru: Синтаксис идентификаторов в Питоне основывается на приложении “UAX-31” к стандарту “Unicode” , с переработкой и изменениями описанными ниже. Также смотрите дополнительные детали в :pep:`3131` .

source: Within the ASCII range (U+0001..U+007F), the valid characters for identifiers are the same as in Python 2.x: the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``.
ru: В ASCII диапазоне (U+0001..U+007F) в идентификаторах допустимы только те же символы, что и в Питоне 2.x : буквы с «``A``» по «``Z``» в верхнем и нижнем регистре, подчеркивание «``_``» и, кроме первого символа идентификатора, – цифры с «``0``» по «``9``» .

source: The Unicode category codes mentioned above stand for:
ru: Использованные выше обозначения категорий Юникода :

source: All identifiers are converted into the normal form NFC while parsing; comparison of identifiers is based on NFC.
ru: Все идентификаторы при лексическом разборе конвертируются в нормализованную форму NFC; и сравнение идентификаторов производится уже в форме NFC.

source: A non-normative HTML file listing all valid identifier characters for Unicode 4.1 can be found at http://www.dcl.hpi.uni-potsdam.de/home/loewis/table-3131.html.
ru: Ненормативный HTML файл со списком всех символов Юникода 4.1 , доступных для использования в идентификаторах, представлен здесь: http://www.dcl.hpi.uni-potsdam.de/home/loewis/table-3131.html .

source: Reserved classes of identifiers
ru: Зарезервированные классы идентификаторов

source: Certain classes of identifiers (besides keywords) have special meanings. These classes are identified by the patterns of leading and trailing underscore characters:
ru: Определенные классы идентификаторов (помимо ключевых слов) имеют особое значение. Эти классы определяются соответствующей комбинацией символов подчеркивания в начале и в конце.

source: Not imported by ``from module import *``. The special identifier ``_`` is used in the interactive interpreter to store the result of the last evaluation; it is stored in the :mod:`builtins` module. When not in interactive mode, ``_`` has no special meaning and is not defined. See section :ref:`import`.
ru: Не импортируются инструкцией «``from module import *``» . Специальный идентификатор «``_``» используется интерактивным интерпретатором для хранения результата последнего вычисления, хранится он в модуле «:mod:`builtins`» . Не в интерактивном режиме «``_``» не имеет специального значения, не определен. (Смотрите раздел “Объявление импорта” :ref:`import` ) .

source: The name ``_`` is often used in conjunction with internationalization; refer to the documentation for the :mod:`gettext` module for more information on this convention.
ru: Имя «``_``» часто используется в связи с интернационализацией, смотрите документацию модуля «:mod:`gettext`» для получения информации по этой договоренности.

source: System-defined names. These names are defined by the interpreter and its implementation (including the standard library); applications should not expect to define additional names using this convention. The set of names of this class defined by Python may be extended in future versions. See section :ref:`specialnames`.
ru: Определенные системой имена. Эти имена определяются интерпретатором и его реализацией (включая стандартную библиотеку). Приложения не должны определять дополнительные имена используя эту форму. Набор имен этого класса, определенных в Питоне, может быть расширен в будущих версиях. Смотрите раздел “Имена специальных методов” :ref:`specialnames` .

source: Class-private names. Names in this category, when used within the context of a class definition, are re-written to use a mangled form to help avoid name clashes between "private" attributes of base and derived classes. See section :ref:`atom-identifiers`.
ru: Частные имена класса. Имена этой категории, при использовании в рамках определения класса, автоматически модифицируются, чтобы избежать конфликтов имен между “частными” атрибутами базовых и производных классов. Смотрите в разделе “Идентификаторы (Имена)” :ref:`atom-identifiers` .

source: Literals are notations for constant values of some built-in types.
ru: “Литералы” - это непосредственная запись постоянных значений некоторых встроенных типов данных.

source: String and Bytes literals
ru: Текстовые (“String”) и байтовые (“Bytes”) “литералы”

source: String literals are described by the following lexical definitions:
ru: Непосредственная запись текстовых данных имеет следующее лексическое определение:

source: One syntactic restriction not indicated by these productions is that whitespace is not allowed between the :token:`stringprefix` or :token:`bytesprefix` and the rest of the literal. The source character set is defined by the encoding declaration; it is UTF-8 if no encoding declaration is given in the source file; see section :ref:`encodings`.
ru: Есть также одно синтаксическое ограничение, не отмеченное в этих определениях: знаки пробелов (пробела, табуляции, перевода страницы) не могут находится между строковым (:token:`stringprefix`) или байтовым (:token:`bytesprefix`) префиксом и остальной частью “литерала” . Набор символов кода программы определяется объявлением кодировки, по умолчанию: UTF-8, смотрите раздел «Объявление кодировки» :ref:`encodings` .

source: In plain English: Both types of literals can be enclosed in matching single quotes (``'``) or double quotes (``"``). They can also be enclosed in matching groups of three single or double quotes (these are generally referred to as *triple-quoted strings*). The backslash (``\``) character is used to escape characters that otherwise have a special meaning, such as newline, backslash itself, or the quote character.
ru: Говоря проще : оба типа “литералов” обрамляются с двух сторон одинаковыми кавычками : или по одной одинарной «``'``» , или по одной двойной «``"``» , или по три одинарных «``'''``» , или по три двойных «``"""``» (*утроенные кавычки*) . Символ бэкслэш «``\``» используется для “экранирования” (вставки в качестве простых печатных) символов, которые иначе бы имели особое значение, таких как знак новой строки, сам бэкслэш или кавычки и т.д. .

source: Bytes literals are always prefixed with ``'b'`` or ``'B'``; they produce an instance of the :class:`bytes` type instead of the :class:`str` type. They may only contain ASCII characters; bytes with a numeric value of 128 or greater must be expressed with escapes.
ru: Байтовым “литералам” должен предшествовать префикс «``'b'``» или «``'B'``» . Они создают экземпляр типа «:class:`bytes`» вместо типа «:class:`str`» . Этот тип может содержать только символы ASCII; байты с численным значением больше 127 записываются с помощью особых последовательностей символов.

source: Both string and bytes literals may optionally be prefixed with a letter ``'r'`` or ``'R'``; such strings are called :dfn:`raw strings` and treat backslashes as literal characters. As a result, in string literals, ``'\U'`` and ``'\u'`` escapes in raw strings are not treated specially.
ru: Строковые литералы могут опционально начинаться с букв «``'r'``» или «``'R'``» ; такие строки называются “сырыми” («:dfn:`raw strings`»), и считают бэкслэш обычным символом. В результате последовательности «``'\U'``» и «``'\u'``» специального значения в “сырых” строках не имеют.

source: In triple-quoted strings, unescaped newlines and quotes are allowed (and are retained), except that three unescaped quotes in a row terminate the string. (A "quote" is the character used to open the string, i.e. either ``'`` or ``"``.)
ru: В текстовых данных в утроенных кавычках – могут присутствовать (и сохраняются как есть) “неэкранированные” знаки новой строки и кавычки (не в виде специальных последовательностей) , кроме трех “неэкранированных” кавычек подряд (того же вида, как и открывавшие), которые завершают запись текста.

source: Unless an ``'r'`` or ``'R'`` prefix is present, escape sequences in strings are interpreted according to rules similar to those used by Standard C. The recognized escape sequences are:
ru: Если нет префикса «``'r'``» или «``'R'``» , специальные последовательности в строках интерпретируются согласно правилам стандартного “C” . Опознаются следующие специальные последовательности:

source: Escape Sequence
ru: Специальная последовательность

source: Notes
ru: Примечания

source: Backslash and newline ignored
ru: Следующая строка считается продолжением этой, а бэкслэш и перевод строки – отбрасываются

source: Backslash (``\``)
ru: Бэкслэш (``\``)

source: Single quote (``'``)
ru: Одинарная кавычка (``'``)

source: Double quote (``"``)
ru: Двойная кавычка (``"``)

source: Character with octal value *ooo*
ru: Символ с восьмиричным значением *ooo*

source: Character with hex value *hh*
ru: Символ с 16-ричным значением *hh*

source: Notes:
ru: Примечания:

source: As in Standard C, up to three octal digits are accepted.
ru: Как и в стандартном “C” , принимается до трех восьмеричных знаков.

source: Unlike in Standard C, exactly two hex digits are required.
ru: В отличие от стандартного “C” , принимается строго два 16-ричных знака.

source: In a bytes literal, hexadecimal and octal escapes denote the byte with the given value. In a string literal, these escapes denote a Unicode character with the given value.
ru: В байтовых данных 16- и 8-ричные специальные последовательности обозначают байт с данным значением. В текстовых данных они обозначают символ Юникода с данным кодом.

source: Individual code units which form parts of a surrogate pair can be encoded using this escape sequence. Exactly four hex digits are required.
ru: Отдельные коды, составляющие части суррогатной пары, могут быть закодированы при помощи специальных последовательностей. В отличие от стандартного “C” , требуется строго два 16-ричных знака.

source: Unlike Standard C, all unrecognized escape sequences are left in the string unchanged, i.e., *the backslash is left in the string*. (This behavior is useful when debugging: if an escape sequence is mistyped, the resulting output is more easily recognized as broken.) It is also important to note that the escape sequences only recognized in string literals fall into the category of unrecognized escapes for bytes literals.
ru: В отличие от стандартного “C”, все неопознанные последовательности символов оставляются в тексте неизменными, т. е. *бэкслэш остается в тексте*. (Такое поведение полезно при отладке: если особая последовательность символов написана неправильно, то в том, что появляется на выходе легче заметить ошибку.) Кроме того, важно отметить, что управляющие последовательности опознающиеся только в записи текста попадают в категорию неопознанных последовательностей в записи байтовых данных.

source: Even in a raw string, string quotes can be escaped with a backslash, but the backslash remains in the string; for example, ``r"\""`` is a valid string literal consisting of two characters: a backslash and a double quote; ``r"\"`` is not a valid string literal (even a raw string cannot end in an odd number of backslashes). Specifically, *a raw string cannot end in a single backslash* (since the backslash would escape the following quote character). Note also that a single backslash followed by a newline is interpreted as those two characters as part of the string, *not* as a line continuation.
ru: Даже в “сыром” тексте кавычки могут быть вставлены через бэкслэш, но бэкслэш остается в строке, например, «``r"\""``»является верной текстовой записью, состоящей из двух символов: бэкслэш и двойные кавычки; «``r"\"``» не является допустимой записью (даже “сырой” текст не может заканчиваться нечётным количеством бэкслэшей). В частности, *“сырой” текст не может оканчиваться одним бэкслэшем* (поскольку бэкслэш превращает следующую за ним кавычку в текст). Отметьте также, что один бэкслэш подряд, за которым сразу следует переход на новую строку интерпретируется как эти два символа, являющиеся частью строки, а *не* как продолжение строки.

source: String literal concatenation
ru: Соединение текстовых записей (текстовых литералов)

source: Multiple adjacent string or bytes literals (delimited by whitespace), possibly using different quoting conventions, are allowed, and their meaning is the same as their concatenation. Thus, ``"hello" 'world'`` is equivalent to ``"helloworld"``. This feature can be used to reduce the number of backslashes needed, to split long strings conveniently across long lines, or even to add comments to parts of strings, for example::
ru: Допустимы несколько идущих подряд текстовых записей, разделённых пробелами (возможно, с использованием разных типов пар кавычек) - их значение эквивалентно значению одной текстовой записи, являющейся их соединением. Таким образом, «``"hello" 'world'``» эквивалентно «``"helloworld"``» . Эта особенность позволяет уменьшать количество необходимых бэкслэшей, удобно разделять длинные тексты на много физических строк, или даже добавлять комментарии к отдельным фрагментам текста, например:

source: Note that this feature is defined at the syntactical level, but implemented at compile time. The '+' operator must be used to concatenate string expressions at run time. Also note that literal concatenation can use different quoting styles for each component (even mixing raw strings and triple quoted strings).
ru: Обратите внимание, что это свойство определено на синтаксическом уровне, а реализуется во время компиляции. Для соединения фрагментов текста во время исполнения – должен использоваться оператор «``+``» . Заметьте также, что при соединении текста могут использоваться различные стили оформления для каждого фрагмента (даже смешивание “сырого” текста и в тройных кавычках) .

source: Numeric literals
ru: Непосредственная запись чисел

source: There are three types of numeric literals: integers, floating point numbers, and imaginary numbers. There are no complex literals (complex numbers can be formed by adding a real number and an imaginary number).
ru: Существуют три формы непосредственной записи для чисел: целых, чисел с плавающей точкой, и мнимых чисел. Не существует непосредственной записи для комплексных чисел (они могут быть сформированы через операцию сложения действительного числа с мнимым).

source: Note that numeric literals do not include a sign; a phrase like ``-1`` is actually an expression composed of the unary operator '``-``' and the literal ``1``.
ru: Заметьте, что знак не является частью записи числа - такая формулировка, как «``-1``» , на самом деле является выражением, состоящим из однооперандного оператора «``-``» и числа «``1``» .

source: Integer literals
ru: Запись целых чисел

source: Integer literals are described by the following lexical definitions:
ru: Запись целых чисел имеет следующее лексическое определение:

source: There is no limit for the length of integer literals apart from what can be stored in available memory.
ru: Нет ограничения длины записи числа, кроме размера доступной памяти.

source: Note that leading zeros in a non-zero decimal number are not allowed. This is for disambiguation with C-style octal literals, which Python used before version 3.0.
ru: Обратите внимание, что нули в начале ненулевого десятичного числа не допускаются. Это сделано для отличения их от восьмеричной записи в стиле “C” , которая использовалась в Питоне до версии 3.0 .

source: Some examples of integer literals::
ru: Некоторые примеры записи целых чисел: ::

source: Floating point literals are described by the following lexical definitions:
ru: Запись дробных чисел имеет следующее лексическое определение:

source: Note that the integer and exponent parts are always interpreted using radix 10. For example, ``077e010`` is legal, and denotes the same number as ``77e10``. The allowed range of floating point literals is implementation-dependent. Some examples of floating point literals::
ru: Заметьте, что в целой и экспонентной частях всегда подразумевается основание 10 . Например, ``077e010`` является допустимым и значит то же, что и ``77e10`` . Допустимый диапазон дробных чисел может различаться в разных реализациях. Примеры записи дробных чисел: ::

source: Note that numeric literals do not include a sign; a phrase like ``-1`` is actually an expression composed of the unary operator ``-`` and the literal ``1``.
ru: Заметьте, что знак не является частью записи числа - такая формулировка, как «``-1``» , на самом деле является выражением, состоящим из однооперандного оператора «``-``» и числа «``1``» .

source: Imaginary literals
ru: Запись мнимых чисел

source: Imaginary literals are described by the following lexical definitions:
ru: Запись мнимых чисел имеет следующее лексическое определение:

source: An imaginary literal yields a complex number with a real part of 0.0. Complex numbers are represented as a pair of floating point numbers and have the same restrictions on their range. To create a complex number with a nonzero real part, add a floating point number to it, e.g., ``(3+4j)``. Some examples of imaginary literals::
ru: Под мнимое число отводится комплексное число с действительной частью «0» . Комплексные числа представлены в виде пары чисел с плавающей точкой, которые имеют обычные ограничения диапазона их значений. Чтобы создать комплексное число с ненулевой действительной частью, нужно сложить обычное дробное число с мнимым числом, например, «``(3+4j)``» . Некоторые примеры записи мнимых чисел: ::

source: Operators
ru: Операторы

source: The following tokens are operators::
ru: Следующие лексемы являются операторами:

source: Delimiters
ru: Разделители

source: The following tokens serve as delimiters in the grammar::
ru: Следующие лексемы выполняют роль грамматических разделителей: ::

source: The period can also occur in floating-point and imaginary literals. A sequence of three periods has a special meaning as an ellipsis literal. The second half of the list, the augmented assignment operators, serve lexically as delimiters, but also perform an operation.
ru: Точка также встречается в записи дробных и мнимых чисел. Последовательность из трех точек имеет особое значение - обозначение пропуска («:term:`ellipsis`»), вторая половина списка – расширенные операции присваивания – служат в качестве лексического разделителя, и одновременно выполняют операцию.

source: The following printing ASCII characters have special meaning as part of other tokens or are otherwise significant to the lexical analyzer::
ru: Следующие печатные символы ASCII имеют особое значение в качестве части других лексем, и, таким образом, важны для лексического анализатора:

source: The following printing ASCII characters are not used in Python. Their occurrence outside string literals and comments is an unconditional error::
ru: Следующие печатные символы ASCII не используются в Питоне. Их появление за пределами записи текстовых данных или комментариев безусловно является ошибкой:

source: Simple statements
ru: Простые инструкции

source: Simple statements are comprised within a single logical line. Several simple statements may occur on a single line separated by semicolons. The syntax for simple statements is:
ru: Простые инструкции ограничены пределами одной условной строки. Но в одной условной строке может помещаться несколько простых инструкций, разделённых точкой с запятой «``;``» . Простые инструкции имеют следующий синтаксис :

source: Expression statements are used (mostly interactively) to compute and write a value, or (usually) to call a procedure (a function that returns no meaningful result; in Python, procedures return the value ``None``). Other uses of expression statements are allowed and occasionally useful. The syntax for an expression statement is:
ru: Выражение - инструкция используется (в основном интерактивно) для вычисления и показа значения, или (обычно) для вызова процедуры (это такая функция, которая не возвращает результата - а в Питоне возвращает формальный результат «:const:`None`» ) . Другие применения выражений - инструкций также возможны и бывают полезны. Выражения - инструкции имеют следующий синтаксис :

source: An expression statement evaluates the expression list (which may be a single expression).
ru: Выражение - инструкция обрабатывает список выражений (в частности из одного выражения) .
